InformationRegisters/УведомлятьИСогласовывать_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УведомлятьИСогласовывать_ат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФинансовыеУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФинансовыеСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКлиентов_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УведомлятьИСогласовывать_ат/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Сотрудник") Тогда
		
		Планирование_Сервер_ат.ПервичноеЗаполнениеСотрудникКлиентПодразделение(Запись.Сотрудник, Запись.Сотрудник, Запись.Клиент, Запись.Подразделение);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Клиент) И Параметры.ЗначенияЗаполнения.Свойство("Подразделение") Тогда
		
		Запись.Клиент = Параметры.ЗначенияЗаполнения.Подразделение.Владелец;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Клиент) И Параметры.ЗначенияЗаполнения.Свойство("Договор") Тогда
		
		Запись.Клиент = Параметры.ЗначенияЗаполнения.Договор.Владелец;
		
	КонецЕсли;
	
КонецПроцедуры
